{"ปัญหาที่เกิดขึ้นทำให้แต่ละฝ่ายต้องตรึกตรองกันอย่างหนัก": "The problem that arose caused each faction to think very hard [about what transpired].", "ปัญหาที่เกิดขึ้นนั้นสร้างความเสียหายได้มากกว่าที่คาดคิดไว้หลายเท่าตัว": "The problem that arose created many times more losses than was anticipated.", "ปัญหาภายในของประเทศไนจีเรียมีมากมายหลายเรื่อง ล้วนแล้วแต่อยู่ในขั้นวิกฤตแทบทั้งสิ้น": "Nigeria’s has many internal problems, all of which are at a critical stage.", "ปัญหาทุจริตคอรัปชั่นที่กัดกร่อนสังคมไทยและอุตสาหกรรมทั่วโลกนับวันจะยิ่งรุนแรงขึ้น": "The problem of corruption which corrodes [both] Thai society and industry worldwide is getting worse and worse every day.", "ปัญหานี้ไม่รู้จบรู้สิ้นเสียทีรังแต่จะยืดเยื้อต่อไปเรื่อย ๆ": "This problem will never end; it just keeps going on and on.", "ปัญหานี้เป็นโจทย์ที่รัฐบาลแก้ไม่ตก": "This is a problem which the government cannot solve.", "ปัญหาที่รัฐบาลบริหารโดยไม่มีความเป็นมืออาชีพ ขาดความเข้าใจ": "This is a problem which the government is handling unprofessionally and without any understanding.", "ปัญหาของเราไม่ใช่เรื่องเงินแต่เป็นเรื่องเวลาเสียมากกว่า": "Our problem is not that we dont have enough money, but, rather, that we dont have enough time.", "ปัญหาใดใครเรียงไว้ต้องแก้ไขเอง": "Whoever gets himself into a problem, must resolve the problem for himself.", "ปัญหาคือหุ้นกู้ของการบินไทยจะขายใคร ๆ ถ้าไม่มีรัฐบาลค้ำประกัน": "The question is who will buy the corporate bonds issued by Thai Airways if the government does not guarantee them?", "ปัญหาปัจจุบันคือ ประเทศเขาไม่มีกลไกหรือองค์กรที่ศักดิ์สิทธิ์พอที่จะเป็นตัวตัดสินได้ ต่างหน่อมแน้มหรือมั่วนิ่ม": "The current problem is that their country does not have the mechanisms or the institutions with sufficient respect and esteem to be able to make decisions; each (of the current institutions) is either (too) naive or (too) opportunistic.", "ปัญหาของบ้านเมืองเวลานี้ยังไม่เหลือวิสัยที่รัฐบาลจะแก้ไขเองได้": "The problems which face our country today are not beyond the government’s own ability to solve.", "ปัญหาที่ต้องเผชิญนอกจากไม่มีที่เก็บข้าวใหม่แล้ว ยังต้องวนกลับมาถามถึงแหล่งเงินที่จะนำมาใช้ในโครงการรับจำนำรอบใหม่": "Several questions need to be faced: in addition to not having sufficient storage space for the rice, we must ask where the funds will come from to use for the new rice pledging program.", "ปัญหาของบ่อนการพนันใหญ่ ๆ หลายแห่งที่ทำให้การจับกุมเป็นไปได้ยาก เพราะมีวิธีสร้างมวลชนห้อมล้อมเป็นผนังทองแดงกำแพงเหล็ก": "The problem with large casinos is many of them make it very difficult to arrest [patrons] because [the casinos] employ a tactic of surrounding [the casinos] with groups of people who act as an impregnable wall.", "ปัญหาไม่ได้อยู่ที่คนถูกตั้ง แต่อยู่ที่คนตั้ง": "The problem does not lie with those appointed, but with who appointed them.", "ปัญหาด้านแรงงานระหว่างคนงานจีนกับนายจ้างชาวญี่ปุ่นเริ่มก่อตัว": "Wage problems between Chinese workers and their Japanese bosses began to crop up.", "ปัญหาไม่เล็กที่พ่อแม่หลายคู่ต้องนั่งกุมขมับ ไม่รู้จะแก้ไขอย่างไรปัญหาหนึ่งคือ เรื่องสมาธิสั้นของลูก": "Their children’s attention deficit disorder is becoming no small problem for parents who are worried and who are having difficulty finding a solution.", "ปัญหาทางเทคนิค": "technical question or problem", "ปัญหามีไว้แก้ ไม่ได้มีไว้กลุ้ม": "[Its] a problem to be solved, not to worry about.", "ปัญหาดังกล่าวเกิดขึ้นก็เนื่องมาจากบ้านเมืองกำลังเติบใหญ่อย่างรวดเร็ว": "These problems arise because our country is expanding at a rapid rate.", "ปัญหาทั้งหลายล้วนเกิดจากน้ำมือของมนุษย์": "All problems are created by the actions of mankind.", "ปัญหาของผู้เลี้ยงช่วงแรกๆ เวลาเลี้ยงแมวเนี่ย คือปัญหาเรื่องอุจจาระของมัน คือแมวเนี่ยมันจะอึเหม็นและมันก็จะอึไม่เป็นที่": "The problem for people who take care of cats is that when the first get them, is what to do with their wastes; that is, excrete really stinky feces and don’t excrete in only one place.", "ปัญหาทางอารมณ์ของวัยรุ่นคือเด็กวัยรุ่นมีอารมณ์อ่อนไหวได้ง่ายและมักพะว้าพะวังเรื่องสังคมและกลุ่มเพื่อนมาก": "The problem concerning teenagers emotions is that children of this age have feelings that are easily changeable and they tend to be very worried about (what their) group of friends and society (think).", "ปัญหาที่คาราคาซังยืดเยื้อคือ ปัญหาการถ่ายโอนการศึกษาไปสังกัดองค์กรปกครองส่วนท้องถิ่น": "The problem that remains unresolved is the problem regarding the transfer of education to be under the jurisdiction of the local administrative organizations.", "ปัญหาของเครื่องแบบรัดติ้วจึงเป็นเรื่องของวัฒนธรรมไม่ใช่เรื่องของผ้าและแบบเสื้อผ้า": "The problem of skin-tight uniforms is therefore a cultural issue, not a clothing or fashion issue.", "ปัญหาทุจริตคอรัปชั่นจะยิ่งฉาวโฉ่ออกมาเรื่อย": "Corruption problems are becoming more widespread every day.", "ปัญหาทางวิชาการ": "technical problems", "ปัญหาทุกอย่างที่เกิดขึ้นจนกลายเป็นวิกฤตในครั้งนี้ พันกันเป็นห่วงโซ่เหมือนงูกินหาง": "All these problems which have arisen to the level of crisis this time are connected in a chain like a snake eating its tail.", "ปัญหาทั้งหลายแหล่ที่เกิดขึ้น เป็นภาวะแรงเสียดทานของสังคมที่ไม่อาจรับการเปลี่ยนแปลงอย่างรวดเร็ว": "All of [our] problems have arisen from frictions created in a society which is unable to accept rapid change.", "ปัญหาของสังคมมนุษย์จะแก้ไขให้บางเบาได้ก็น่าจะด้วยความพยายามของมนุษย์": "Problems of human society can be solved or ameliorated only through the efforts of humanity (itself)."}